/*4. Собственная реализация qsort
Описание:
Реализуйте сортировку массива строк с помощью qsort, но с кастомной функцией сравнения, 
передаваемой через указатель на функцию.
Должны быть доступны три варианта сортировки:

По алфавиту
По длине строки
По количеству гласных букв
Пользователь вводит строки, затем выбирает режим сортировки.

🔹 Дополнительно: Можно реализовать сравнение без учёта регистра.

*/

#include <stdio.h>
#include <stdlib.h>
#include <string.h>

int main(){
    char str[100];
    fgets(str, 100, stdin);
    

    return 0;
}