/*Задача 2. Отправка закодированных сигналов на Землю
Условие:
Космический спутник передаёт зашифрованное сообщение в виде строки, 
но оно может содержать лишние символы в начале и в конце, которые нужно отбросить.
Нужно найти первую позицию, где начинается сообщение (не # или *), и длину полезной части.

Входные данные:
Одна строка (≤ 100 символов), содержащая сообщение, окружённое случайными # и *.

Выходные данные:

Очищенное сообщение
Длина сообщения
Подсказка: Используйте strcspn, чтобы найти первую полезную букву.*/

#include <stdio.h>

int main(){

    return 0;
}